---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarReinforcementData.End
source: html/b5b585fc-442b-670c-91b0-e6504b4c5dad.htm
---
# Autodesk.Revit.DB.Structure.RebarReinforcementData.End Property

The end of the rebar. The end should be 0 or 1.

## Syntax (C#)
```csharp
public int End { get; set; }
```